readme.html
<!doctype html>
<html lang="en">
<head>
<title>My Dotfiles</title>
<!-- 2019-01-26 Sat 02:05 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Paul Joshy">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">My Dotfiles</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> bugs</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> <span class="label label-primary TODO">TODO</span> rangershortcuts and profileshortcuts scripts</h3>
<div class="outline-text-3" id="text-1-1">
<p>
files:
<a href="scripts/rangershortcuts.awk">rangershortcuts</a>
<a href="scripts/profileshortcuts.awk">profile shortcuts</a>
</p>

<p>
Issue:
Scripts for the first item in the <a href="scripts/shortcuts">shortcuts file</a> isn't working properly
</p>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> <span class="label label-primary TODO">TODO</span> keybindings for screenshots</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Files:
<a href="config/i3/config">i3 config file</a>
</p>

<p>
Issue:
scrot keybindings not working for i3
</p>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> <span class="label label-primary TODO">TODO</span> emacs snippet shortcut not working</h3>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Wishlist</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> work mode</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Open all projects specified in a file in vscode
</li>
<li>Run the programs
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> emacs</h3>
<div class="outline-text-3" id="text-2-2">
</div><div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> <span class="label label-primary TODO">TODO</span> Add support for using the <a href="scripts/shortcuts">shortcut</a> variables</h4>
</div>
<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> <span class="label label-primary TODO">TODO</span> add export support for the foll</h4>
<div class="outline-text-4" id="text-2-2-2">
</div><ol class="org-ol"><li><a id="sec-2-2-2-1" name="sec-2-2-2-1"></a>Twitter bootstrap<br ></li>
<li><a id="sec-2-2-2-2" name="sec-2-2-2-2"></a>Latex Support<br ></li>
<li><a id="sec-2-2-2-3" name="sec-2-2-2-3"></a>PPT support using beamer<br ></li></ol>
</div>
<div id="outline-container-sec-2-2-3" class="outline-4">
<h4 id="sec-2-2-3"><span class="section-number-4">2.2.3</span> Toggle between emacs and spacemacs</h4>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> ledger</h3>
<div class="outline-text-3" id="text-2-3">
</div><div id="outline-container-sec-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="section-number-4">2.3.1</span> <span class="label label-primary TODO">TODO</span> Add script to convert telegram entries to journal entries</h4>
<div class="outline-text-4" id="text-2-3-1">
<ul class="org-ul">
<li>Or hopefully, a telegram bot
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> i3</h3>
<div class="outline-text-3" id="text-2-4">
</div><div id="outline-container-sec-2-4-1" class="outline-4">
<h4 id="sec-2-4-1"><span class="section-number-4">2.4.1</span> <span class="label label-primary TODO">TODO</span> Change the default theme</h4>
</div>
<div id="outline-container-sec-2-4-2" class="outline-4">
<h4 id="sec-2-4-2"><span class="section-number-4">2.4.2</span> <span class="label label-primary TODO">TODO</span> Change clock to 12 hr format</h4>
</div>
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. bugs</a>
<ul class="nav">
<li><a href="#sec-1-1">1.1. rangershortcuts and profileshortcuts scripts</a></li>
<li><a href="#sec-1-2">1.2. keybindings for screenshots</a></li>
<li><a href="#sec-1-3">1.3. emacs snippet shortcut not working</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Wishlist</a>
<ul class="nav">
<li><a href="#sec-2-1">2.1. work mode</a></li>
<li><a href="#sec-2-2">2.2. emacs</a>
<ul class="nav">
<li><a href="#sec-2-2-1">2.2.1. Add support for using the shortcut variables</a></li>
<li><a href="#sec-2-2-2">2.2.2. add export support for the foll</a></li>
<li><a href="#sec-2-2-3">2.2.3. Toggle between emacs and spacemacs</a></li>
</ul>
</li>
<li><a href="#sec-2-3">2.3. ledger</a>
<ul class="nav">
<li><a href="#sec-2-3-1">2.3.1. Add script to convert telegram entries to journal entries</a></li>
</ul>
</li>
<li><a href="#sec-2-4">2.4. i3</a>
<ul class="nav">
<li><a href="#sec-2-4-1">2.4.1. Change the default theme</a></li>
<li><a href="#sec-2-4-2">2.4.2. Change clock to 12 hr format</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</nav>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: Paul Joshy</p>
<p class="date">Created: 2019-01-26 Sat 02:05</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.2 (<a href="http://orgmode.org">Org-mode</a> 9.2)</p>
</div>
</footer>
</body>
</html>
